Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Daytime Star.tmx
Source language: en
Languages: es_419

source: honestly, seunghyeon rarely recommends people.
es_419: la verdad es que seunghyeon nunca recomienda a nadie.

source: …but our agency thinks highly of yura's talent.
es_419: … pero nuestra agencia valora el talento de yura.

source: thank you, sir.
es_419: gracias, señor.

source: come on now! you're the one who wanted to drink! get up!
es_419: ¡vamos! ¡tú eres la que quería beber! ¡levántate!

source: l-let's…
es_419: a… a…

source: yes, that coat will be perfect!
es_419: ¡sí, ese abrigo será perfecto!

source: I'm in myeongdong.
es_419: en myeongdong.

source: wait. how do you know my name?
es_419: aguarda. ¿cómo sabes mi nombre?

source: I went to bed early after shooting my scene, so I wasn't aware you had an all-nighter.
es_419: me acosté temprano después de rodar mi escena, así que no me enteré.

source: why? what's the matter?
es_419: ¿por qué? ¿qué pasa?

source: ELEGANT TABLE AUDITION SCRIPT
es_419: MESA ELEGANTE GUION DE AUDICIÓN

source: you remember?! you lent it to me about a year ago when we were shooting a commercial.
es_419: ¡¿lo recuerdas?! me lo prestaste hace un año cuando estábamos grabando un comercial.

source: I was listening to the korean star's love story…
es_419: escuchaba la historia de amor de la estrella coreana…

source: that's it!
es_419: ¡es ahí!

source: haa...{j}I was gonna play poker with the other managers tonight, but I guess that's not happening.
es_419: aah…{j}esta noche iba a jugar al póquer con los otros representantes, pero supongo que eso no sucederá.

source: I figured you had a minor role...
es_419: asumí que tenías un papel menor,

source: why did you want to see me?
es_419: ¿para qué querías verme?

source: hey, seunghyeon… you were ranting and raving about me nagging you too early on…
es_419: oye, seunghyeon, despotricaste porque yo te regañé demasiado pronto…

source: have you ever seen him slacking off?
es_419: ¿alguna vez lo has visto holgazaneando?

source: several staff members will be out shooting all night with seunghyeon, so you won't be too uncomfortable.
es_419: varios miembros del personal estarán rodando toda la noche con seunghyeon, así que no estarán demasiado incómodas.

source: the director, nixx, and the staff--
es_419: el director, nixx y el personal…

source: ...you've never gone abroad for a photo shoot, so you wouldn't know the details on the schedule.
es_419: … nunca has ido al extranjero para una sesión de fotos, así que no podías conocer los detalles.

source: splat
es_419: PLAS

source: if you're choosing an actress who'll be working with me, I think it'd be helpful for me to see for myself.
es_419: si están eligiendo a la actriz que trabajará conmigo, quizá sería útil que yo estuviera presente.

source: what? n-now?
es_419: ¿qué? ¿a-ahora?

source: well, that's because…
es_419: bueno, es porque…

source: I really wanted to watch the movie…
es_419: tenía ganas de ver la película…

source: what're these autographs?
es_419: ¿qué son estos autógrafos?

source: I must've left it at that table...
es_419: debo haberlas dejado en esa mesa…

source: you're welcome.
es_419: de nada.

source: the drama set to start in may seems pretty good. what do you think?
es_419: el drama que comenzará en mayo parece bastante bueno. ¿qué piensas?

source: speak of the devil…
es_419: hablando del rey de roma…

source: I was so stressed with changhyeon's issue.{j}I left it to the assistant director to pick someone for the role and he brought her.
es_419: estaba muy agobiado con el problema de changhyeon.{j}dejé que el asistente de dirección eligiera a alguien para el papel y él la trajo.

source: I guess there's nothing I can do.
es_419: supongo que no hay remedio.

source: I didn't know you were into this kind of stuff...
es_419: no sabía que te gustaran ese tipo de cosas…

source: she's got grit.
es_419: tiene valor.

source: what's wrong? are we short on rooms?
es_419: ¿qué sucede? ¿no hay cuartos disponibles?

source: I met him a month ago for the first time at miran's wedding. who'd have thought I'd see him again like this?
es_419: lo conocí hace un mes en la boda de miran. ¿quién hubiera pensado que lo volvería a encontrar en esta situación?

source: you're making it more awkward!
es_419: ¡dicho así suena peor!

source: I'm sure of it!
es_419: ¡estoy segura!

source: wicked bastard.
es_419: maldito imbécil.

source: th-the snowfall's heavy out there. did you get here okay?
es_419: e-está nevando mucho. ¿llegaste sin problemas?
